/*************************************************************************
*   版权所有(C) 2008-2013 深圳华为技术有限公司.
*
*   文 件 名 :  soc_interrupts_comm.h
*
*   作    者 :  y00184236
*
*   描    述 :  k3v3 v7r2  中断map 公共中断
*
*   修改记录 :  2013年8月30日  v1.00  y00184236  创建
*************************************************************************/

#ifndef __SOC_INTERRUPTS_COMM_H
#define __SOC_INTERRUPTS_COMM_H

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************
                  * interrupts level comm*
***************************************************************************/
#ifdef __cplusplus
}
#endif

#endif    /* __SOC_INTERRUPTS_COMM_H */

